README.md

# &Iacute;ndice

1.  [Sobre Mí](#org9448849)
    1.  [Bienvenida](#org3504eb9)
    2.  [Conocimientos](#org9ed9096)
    3.  [Objetivos](#org9abfb4a)

-   **Última Edición:** 02-09-2022, Guennadi Maximov


<a id="org9448849"></a>

# Sobre Mí


<a id="org3504eb9"></a>

## Bienvenida

Les doy una cordial bienvenida al Club de Programación de TICS. Mi nombre es
[Guennadi Maximov](https://github.com/DrKJeff16). Soy un estudiante de 3er
semestre de TICS a día de hoy y soy el fundador del club, así como el
administrador de este repositorio.


<a id="org9ed9096"></a>

## Conocimientos

Mi experiencia con programación se divide en varios rubros, ordenados de
mayor experiencia a menor experiencia:

-   **<span class="underline">Lenguajes de Programación</span>**
    1.  BASH / sh
    2.  Python
    3.  C
    4.  C++
    5.  SQL (*enfocado a MariaDB*)
    6.  Java
    7.  Javascript
    8.  C#

-   **<span class="underline">Lenguajes De Estructuración De Documentos</span>**
    1.  Markdown
    2.  Emacs Org Mode
    3.  HTML+CSS
    4.  LaTeX
    5.  RST


<a id="org9abfb4a"></a>

## Objetivos

El principal objetivo de este club es ayudar de manera comunitaria y
voluntaria a resolver problemas concernientes a conceptos varios de
computación, incluyendo, pero no limitándose a:

-   Instalar y manejar sistemas ***UNIX*** (*Linux*, *BSD*, *MacOS*), ya sea en
    una computadora o en una máquina virtual.
-   Comprender la estructura de un sistema de archivos, incluyendo cómo
    manipularlos, ubicarlos y ordenarlos de manera óptima.
-   Montar un ambiente de trabajo y estudio óptimo para resolver problemas de
    programación y fomentar un uso correcto de las herramientas.
-   Explicar conceptos fundamentales de lógica, flujos de ejecución, ejecución
    y estructura de programas y/o algoritmos dados.
-   Resolver dudas y explicar los diferentes métodos para resolver un problema
    en particular.
-   Dar sentido práctico a la programación.
-   Proporcionar apoyo e instrucción para el uso de la consola de sistemas
    ***UNIX***, particularmente **[BASH](https://es.wikipedia.org/wiki/Bash)**.
-   Instruir en el uso de sistemas de
    [control de versiones](https://es.wikipedia.org/wiki/Control_de_versiones),
    en particular <span class="underline">[Git](https://es.wikipedia.org/wiki/Git)</span>.

